{
  "First_and_Last_Name": "Acupuncture Clinic",
  "About": "Acupuncture Clinic is a Acupuncturist facility at 3245 Lorna Rd in Birmingham, AL.",
  "Services": [
    "Acupuncture Clinic is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Acupuncture Clinic at (205) 979-4079 for a detailed description of the services offered. ",
    "Acupuncturist like Acupuncture Clinic offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture Clinic for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Phone": "(205) 979-4079",
  "Address": "3245 Lorna Rd, Birmingham, AL  35216"
}
{
  "First_and_Last_Name": "Julie Gannon, O.D.",
  "About": "Julie Gannon, O.D. practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Julie Gannon, O.D. is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Julie Gannon, O.D. at (205) 930-0930 for a detailed description of the services offered. ",
    "Acupuncturist like Julie Gannon, O.D. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Julie Gannon, O.D. for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Phone": "(205) 930-0930",
  "Address": "1201 11th Avenue S, Suite 501, Birmingham, AL  35205"
}
{
  "First_and_Last_Name": "Martha Jane Ivey",
  "About": "Martha Jane Ivey practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Martha Jane Ivey is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Martha Jane Ivey at (205) 324-6003 for a detailed description of the services offered. ",
    "Acupuncturist like Martha Jane Ivey offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Martha Jane Ivey for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Phone": "(205) 324-6003",
  "Address": "603 37th St. South, Birmingham, AL  35222"
}
{
  "First_and_Last_Name": "Rama Khalsa",
  "About": "Rama Khalsa practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Rama Khalsa is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Rama Khalsa at (205) 266-3834 for a detailed description of the services offered. ",
    "Acupuncturist like Rama Khalsa offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Rama Khalsa for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Phone": "(205) 266-3834",
  "Address": "1901 Richard Arrington Jr Blvd, Birmingham, AL  35205"
}
{
  "First_and_Last_Name": "Martha Ivey",
  "About": "Martha Ivey practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Martha Ivey is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Martha Ivey at (205) 324-6003 for a detailed description of the services offered. ",
    "Acupuncturist like Martha Ivey offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Martha Ivey for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(6 Reviews)",
  "Phone": "(205) 324-6003",
  "Address": "603 37th Street  South, Birmingham, AL  35222"
}
{
  "First_and_Last_Name": "Stephen Zhao",
  "About": "Stephen Zhao practices as an  Acupuncturist in Hoover, AL.",
  "Services": [
    "Stephen Zhao is an Acupuncturist or Acupuncture office in Hoover, AL. Call Stephen Zhao at (205) 822-5552 for a detailed description of the services offered. ",
    "Acupuncturist like Stephen Zhao offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Stephen Zhao for information about your acupuncture needs in Hoover, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(4 Reviews)",
  "Phone": "(205) 822-5552",
  "Address": "1564 Montgomery Hwy., Hoover, AL  35216"
}
{
  "First_and_Last_Name": "Ramsay Falcove",
  "About": "Ramsay Falcove practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Ramsay Falcove is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Ramsay Falcove at (205) 369-0385 for a detailed description of the services offered. ",
    "Acupuncturist like Ramsay Falcove offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Ramsay Falcove for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Primary Specialty",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(5 Reviews)",
  "Phone": "(205) 369-0385",
  "Address": "1730 B Valley Ave, Birmingham, AL  35209"
}
{
  "First_and_Last_Name": "GERALD COLLINS, DC",
  "About": "OVER 28 YEARS EXPERIENCE IN TREATING AUTO ACCIDENTS AND DISC INJURIES.  WE OFFER COURTESY TRANSPORTATION IF YOUR CAR IS DISABLED DUE TO THE ACCIDENT.  FEDERAL ENTITLEMENTS ARE EXCLUDED.    ",
  "Services": [
    "GERALD COLLINS, DC practices at 552 BESSEMER HWY, MIDFIELD, AL  35228. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "GERALD COLLINS, DC may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with GERALD COLLINS, DC in MIDFIELD, AL, please call (205) 923-0151 for more information."
  ],
  "Primary_Specialty": [
    "Chiropractor"
  ],
  "Practice": "Years In Practice",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(9 Reviews)",
  "Phone": "(205) 923-0151",
  "Address": "552 BESSEMER HWY, MIDFIELD, AL  35228"
}
{
  "First_and_Last_Name": "Yao  Lu, Dr",
  "About": "Welcome to Auricular Medicine International Research & Training Center online! For more than 10 years, we have provided to all people worldwide with professional auricular medicine services to help improve their mental and physical health. Our services are perfect for anyone who wishes to enhance their current health, relieve pain and stress, or recover from illness or injury.",
  "Services": [
    "We offer various type Acupuncture medicine services as following:",
    "Chronicle Ache Treatment:",
    "Fibromyositis of shoulder and back, mid back pain, sciatic neuralgia, gout, history of injuries, tennis or golf elbow, tingling, arthritis, periarthritis shoulder, cramps.",
    "Disturbed Nerve Function Treatment:",
    "Neurasthenia insomnia, depression treatment, nerve system, numbness, migraine, anxiety, fatigue, psychoneurosis, facial paralysis, disturbed function of autonomic nerve, stroke paralysis.",
    "Allergic Diseases Treatment:",
    "Pollen hypersensitivity, Seasonal Allergies, nasal symptom allergies.",
    "Internal Diseases Treatment:",
    "Asthma, bronchitis, chronic gastritis, gastric ulcer, duodenal ulcer, consternation, hemorrhoid, diarrhea, chronic cholecystitis.",
    "Chinese Cupping Service:",
    "Cupping therapy is an Chinese alternative medicine where using a small glass cup with heat created by fire to generate a suction in the surface of the skin which could mobilize the blood flow movement to promote different type of pain and self healing.",
    "Chinese Acupressure Service:",
    "Chinese Acupressure is an alternative ancient healing medicine which using a set of standard finger massage movement on human body healing points, the purpose of the acupressure practice is to stimulate the body's natural self healing abilities.",
    "Chinese Moxibustion Service:",
    "Moxibustion is a Alternative traditional Chinese medicine therapy using Moxa made from dried Mugwort.",
    "Chinese Gua Sha Service:",
    "Gua Sha means scraping bruises on the skin, it is a alternative traditional Chinese medicine treatment in which the skin is scraped to produce light bruising.",
    "Chinese Reflexology Service:",
    "Reflexology is focusing special type of massage movement on the areas of the feet that practitioners believe correspond with organs in different part the body to diagnosis and promote healing.",
    "Chinese Herbs:",
    "Chinese Herbs is the eastern alternative traditional theory of Chinese herbal therapy, which is a part of nutritional treatments consisted in traditional Chinese medicine (TCM).",
    "And a Lot Acupuncture medicine not to list here",
    "Auricular Medicine"
  ],
  "Primary_Specialty": [
    "Acupuncturist"
  ],
  "Practice": "Years In Practice",
  "Education": [
    "Beijing Medical College,China in 1987"
  ],
  "Training": [
    "Auricular Medicine Therapy"
  ],
  "Customer Feedback": "(2 Reviews)",
  "Phone": "(205) 527-4202",
  "Address": "2104 Chapel Hill Rd, Birmingham, AL  35266"
}
{
  "First_and_Last_Name": "Chiropractor, Acupuncture",
  "About": "Chiropractor, Acupuncture practices as a  Chiropractic Sports Physician in Birmingham, AL.",
  "Services": [
    "Chiropractor, Acupuncture is a Chiropractic Sports Physician/office located in Birmingham, AL 35213. A Chiropractic Sports Physician is a fully trained chiropractor who is trained to offer care for athletes in the management, rehabilitation, and performance optimization of their neuromusculoskeletal systems. Chiropractic Sports Physicians are responsible for advancements in protective gear and have played a role in preventing spinal injuries in athletes. ",
    "Please call Chiropractor, Acupuncture at (205) 957-5445 to schedule an appointment in Birmingham, AL or to get more information.",
    "Acupuncture"
  ],
  "Primary_Specialty": [
    "Chiropractic Sports Physician"
  ],
  "Practice": "Years In Practice",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(1 Review)",
  "Phone": "(205) 957-5445",
  "Address": "972 Molntclair Rd, Birmingham, AL  35213"
}
{
  "First_and_Last_Name": "Cherie Johnson, Dr.",
  "About": "Cherie Johnson, Dr. practices as a  Chiropractor in Birmingham, AL.",
  "Services": [
    "Cherie Johnson, Dr. practices at 2800 Greystone Commercial Blvd. Suite 2B, Birmingham, AL  35242. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "Cherie Johnson, Dr. may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with Cherie Johnson, Dr. in Birmingham, AL, please call (205) 408-5600 for more information.",
    "chiropractic care, acupuncture, nutrition,"
  ],
  "Primary_Specialty": [
    "Chiropractor"
  ],
  "Practice": "Years In Practice",
  "Education": [],
  "Training": "N/A",
  "Customer Feedback": "(1 Review)",
  "Phone": "(205) 408-5600",
  "Address": "2800 Greystone Commercial Blvd. Suite 2B, Birmingham, AL  35242"
}
